src/main/resources/reports/stage2/put_results/wrk/wrk_put_9_poll_new_no_close_bug.txt
Running 10s test @ http://localhost:8080
  1 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms    1.38ms  21.60ms   94.86%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.29ms
 75.000%    1.78ms
 90.000%    2.29ms
 99.000%    7.19ms
 99.900%   17.41ms
 99.990%   20.62ms
 99.999%   21.15ms
100.000%   21.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.050     0.000000            1         1.00
       0.552     0.100000         9982         1.11
       0.752     0.200000        19991         1.25
       0.927     0.300000        29928         1.43
       1.105     0.400000        39865         1.67
       1.289     0.500000        49827         2.00
       1.380     0.550000        54834         2.22
       1.469     0.600000        59806         2.50
       1.564     0.650000        64798         2.86
       1.669     0.700000        69753         3.33
       1.783     0.750000        74717         4.00
       1.845     0.775000        77202         4.44
       1.910     0.800000        79688         5.00
       1.984     0.825000        82207         5.71
       2.067     0.850000        84723         6.67
       2.165     0.875000        87168         8.00
       2.223     0.887500        88417         8.89
       2.293     0.900000        89652        10.00
       2.383     0.912500        90893        11.43
       2.495     0.925000        92144        13.33
       2.643     0.937500        93392        16.00
       2.743     0.943750        94007        17.78
       2.867     0.950000        94629        20.00
       3.027     0.956250        95254        22.86
       3.211     0.962500        95879        26.67
       3.511     0.968750        96498        32.00
       3.689     0.971875        96809        35.56
       3.891     0.975000        97122        40.00
       4.131     0.978125        97431        45.71
       4.511     0.981250        97743        53.33
       5.119     0.984375        98051        64.00
       5.535     0.985938        98207        71.11
       6.043     0.987500        98363        80.00
       6.651     0.989062        98518        91.43
       7.543     0.990625        98674       106.67
       8.823     0.992188        98829       128.00
       9.679     0.992969        98907       142.22
      10.431     0.993750        98985       160.00
      11.279     0.994531        99063       182.86
      12.047     0.995313        99141       213.33
      12.719     0.996094        99218       256.00
      13.167     0.996484        99257       284.44
      13.639     0.996875        99296       320.00
      14.143     0.997266        99335       365.71
      14.631     0.997656        99374       426.67
      15.247     0.998047        99413       512.00
      15.527     0.998242        99432       568.89
      15.887     0.998437        99452       640.00
      16.319     0.998633        99471       731.43
      16.815     0.998828        99492       853.33
      17.631     0.999023        99511      1024.00
      17.871     0.999121        99520      1137.78
      18.191     0.999219        99530      1280.00
      18.623     0.999316        99539      1462.86
      18.879     0.999414        99549      1706.67
      19.199     0.999512        99559      2048.00
      19.455     0.999561        99564      2275.56
      19.631     0.999609        99569      2560.00
      19.807     0.999658        99573      2925.71
      19.951     0.999707        99579      3413.33
      20.079     0.999756        99583      4096.00
      20.223     0.999780        99586      4551.11
      20.303     0.999805        99588      5120.00
      20.351     0.999829        99590      5851.43
      20.463     0.999854        99593      6826.67
      20.543     0.999878        99595      8192.00
      20.623     0.999890        99597      9102.22
      20.671     0.999902        99598     10240.00
      20.687     0.999915        99599     11702.86
      20.703     0.999927        99600     13653.33
      20.767     0.999939        99601     16384.00
      20.815     0.999945        99602     18204.44
      20.927     0.999951        99603     20480.00
      20.927     0.999957        99603     23405.71
      20.959     0.999963        99604     27306.67
      20.959     0.999969        99604     32768.00
      21.071     0.999973        99605     36408.89
      21.071     0.999976        99605     40960.00
      21.071     0.999979        99605     46811.43
      21.151     0.999982        99606     54613.33
      21.151     0.999985        99606     65536.00
      21.151     0.999986        99606     72817.78
      21.151     0.999988        99606     81920.00
      21.151     0.999989        99606     93622.86
      21.615     0.999991        99607    109226.67
      21.615     1.000000        99607          inf
#[Mean    =        1.494, StdDeviation   =        1.380]
#[Max     =       21.600, Total count    =        99607]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99616 requests in 10.00s, 7.03MB read
Requests/sec:   9961.61
Transfer/sec:    719.88KB